use aishangce;
db.test.insert({
'id':0,
'type': 'next',
'image':'http://bestbwzs.com/images/camera.jpg',
'title':'你在爱情中“受伤率”有多高',
'intro':'爱情中免不了受伤，你会是最容易受伤的哪个吗？',
'question': [{
    'id': 0,
    'title': '你觉得自己运气还不错？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '3',
      '2',
      '1'
    ]}, {
    'id': 1,
    'title': '有人借走你的东西，你会记得吗？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '4',
      '3',
      '2'
    ]}, {
    'id': 2,
    'title': '你赞同爱情里的人都是盲目的吗？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '5',
      '4',
      '3'
    ]}, {
    'id': 3,
    'title': '你的内心情感比较细腻？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '6',
      '5',
      '4'
    ]}, {
    'id': 4,
    'title': '你是一个强势的人吗？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '7',
      '6',
      '5'
    ]}, {
    'id': 5,
    'title': '你曾经暗恋过某个人吗？',
    'image': '',
    'options': [
      '是的，而且不止一个',
      '是的，只有一个',
      '不是'
    ],
    'next': [
      '6',
      '7',
      '-1'
    ]}, {
    'id': 6,
    'title': '你对爱情有很高的期待或者要求？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '8',
      '9',
      '7'
    ]}, {
    'id': 7,
    'title': '有人说过你很敏感？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '-1',
      '8',
      '9'
    ]}, {
    'id': 8,
    'title': '如果和恋人吵架了，你会：',
    'image': '',
    'options': [
      '争论对错',
      '冷战逃避',
      '求和示好'
    ],
    'next': [
      '-1',
      '-2',
      '-3'
    ]}, {
    'id': 9,
    'title': '如果有人（不讨厌也不喜欢）跟你表白，你会：',
    'image': '',
    'options': [
      '答应对方',
      '考虑一下',
      '拒绝对方'
    ],
    'next': [
      '-2',
      '-3',
      '-4'
    ]
  }],
'result': [{
    'id': 0,
    'title': '受伤率：90%',
    'content': '你对于爱情有憧憬和期待，但是爱情中有甜蜜，也会有摩擦。两个不同的个体在一起，不可避免地会有磨合的事情，但是有时候你可能过于敏感，又或者过于执着于自己的态度，而忽略了对方，导致最后的结局往往并不好。为此，你会感到十分受伤。'
  }, {
    'id': 1,
    'title': '受伤率：70%',
    'content': '你在关系中比较有可能会受伤，这可能源于你不太懂得如何去维护关系。你采取的方式对你来说是轻松的，但是对关系来说却未必是有益的，甚至可能会影响关系。如果不想在感情中受伤，你应该正视自己的内心，学会如何去爱，去表达。'
  }, {
    'id': 2,
    'title': '受伤率：50%',
    'content': '你对于爱情抱有比较开放的态度，不会坚持一些固有的观念，而是会敢于尝试，主动迈出第一步。但是爱情有时候并不尽如人意，好在你也明白这一点，并不会强求，面对爱情中可能的伤害也比较看得开，更可能采取积极的方式来解决。'
  }, {
    'id': 3,
    'title': '受伤率：30%',
    'content': '你的受伤率很低，但这来源于你不给对方机会，以此来切断自己受伤的可能。你对爱情可能有着比较消极的想法，不太想进入一段关系，面对爱情，常常是望而却步。然而这样的你，内心并不是真的强大，只是你用围墙把自己保护起来而已。'
  }]
});

db.test.insert({
  'id': 1,
  'image': '/images/san_francisco.jpg',
  'title': '你是一个性格多变的人吗',
  'intro': '测一测，别人眼里的你是不是多变的？',
  'question': [{
    'id': 0,
    'title': '你觉得自己运气还不错？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '1',
      '3',
      '2'
    ]
  }, {
    'id': 1,
    'type': 'next',
    'title': '你的性格比较外向？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '一般'
    ],
    'next': [
      '3',
      '2',
      '4'
    ]
  }, {
    'id': 2,
    'title': '你的朋友多吗？',
    'image': '',
    'options': [
      '多',
      '不多',
      '一般'
    ],
    'next': [
      '4',
      '5',
      '3'
    ]
  }, {
    'id': 3,
    'title': '你相信自己有能力面对生活的变化吗？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '6',
      '5',
      '4'
    ]
  }, {
    'id': 4,
    'title': '你有广泛的兴趣爱好？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '6',
      '7',
      '5'
    ]
  }, {
    'id': 5,
    'title': '你的想象力比较丰富？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '6',
      '7',
      '-3'
    ]
  }, {
    'id': 6,
    'title': '如果你讲出自己真实的一面，别人会相当惊讶？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '-2',
      '-1',
      '7'
    ]
  }, {
    'id': 7,
    'title': '如果计划遇到阻滞，你更可能会：',
    'image': '',
    'options': [
      '坚定计划',
      '调整计划',
      '放弃计划'
    ],
    'next': [
      '-4',
      '-3',
      '-1'
    ]
  }],
  'result': [{
    'id': 0,
    'title': '多变指数：★★★★☆',
    'content': '你并不是一个性格多变的人，你的“多变”更多是来源于你的不坚定。你需要得到他人的肯定才会感到安心，才会敢继续下一步。所以有时候，为了迎合别人，你会改变自己的想法和行为。'
  }, {
    'id': 1,
    'title': '多变指数：★★★★★',
    'content': '你灵活多变，对于生活中发生的事情，总是有很多奇思妙想。所以在别人看来，你是一个性格多变的人，常常会用不同寻常的方式。你不喜欢一成不变的生活，总是根据自己喜欢的方式和当下的心情来行动。'
  }, {
    'id': 2,
    'title': '多变指数：★★★☆☆',
    'content': '你并不是一个很多变的人，但是你有着灵活的一面，在不同的时候，不同的人面前，你会适时调整自我，采用不同的方式去对待 。在别人看来，你既稳重，又懂得变通。'
  }, {
    'id': 3,
    'title': '多变指数：★★☆☆☆',
    'content': '你对自己比较有自信，会坚定自己的想法和计划，这样的你比较踏实沉稳，性格并不多变。但值得注意的是，你的自信应该是建立在能力之上的，如果不多多听取别人的意见，你的“一成不变”就会成为别人眼里的固执了。'
  }]
});
db.test.insert({
  'id': 2,
  'type': 'next',
  'image': '/images/cornfield.jpg',
  'title': '四排吃鸡，你适合什么位置',
  'intro': '各位鸡友们，还在为自己的位置迷茫吗？',
  'question': [{
    'id': 0,
    'title': '你喜欢怎么搭配枪械？',
    'image': '',
    'options': [
      'M416+AKM',
      'M416+狙击枪',
      'AKM+冲锋枪',
      'AKM+狙击枪'
    ],
    'next': [
      '1',
      '2',
      '1',
      '2'
    ]
  }, {
    'id': 1,
    'title': '自动步枪，你喜欢带多少子弹？',
    'image': '',
    'options': [
      '200发及以下',
      '200发以上'
    ],
    'next': [
      '2',
      '3'
    ]
  }, {
    'id': 2,
    'title': '背包满了，你优先扔掉什么？',
    'image': '',
    'options': [
      '烟雾弹',
      '手雷',
      '急救包',
      '子弹'
    ],
    'next': [
      '4',
      '3',
      '4',
      '3'
    ]
  }, {
    'id': 3,
    'title': '你喜欢当司机还是乘客？',
    'image': '',
    'options': [
      '司机',
      '乘客'
    ],
    'next': [
      '5',
      '4'
    ]
  }, {
    'id': 4,
    'title': '队友被击倒时，你优先做什么？',
    'image': '',
    'options': [
      '灭了敌人',
      '封烟救人'
    ],
    'next': [
      '6',
      '5'
    ]
  }, {
    'id': 5,
    'title': '敌人在守楼时，你会怎么做？',
    'image': '',
    'options': [
      '直接攻楼',
      '扔震爆弹、手雷进去再攻楼',
      '在屋外瞄着，等敌人冒头'
    ],
    'next': [
      '6',
      '7',
      '8'
    ]
  }, {
    'id': 6,
    'title': '半血的三级头和完好的二级头，你会选哪个？',
    'image': '',
    'options': [
      '半血的三级头',
      '完好的二级头'
    ],
    'next': [
      '7',
      '8'
    ]
  }, {
    'id': 7,
    'title': '前方发现敌人时，你会怎么做？',
    'image': '',
    'options': [
      '直接冲上去扫射',
      '等队友先上，自己殿后',
      '远距离放冷枪',
      '躲起来等敌人路过再偷袭'
    ],
    'next': [
      '-3',
      '8',
      '-2',
      '9'
    ]
  }, {
    'id': 8,
    'title': '当你受到攻击时，你会怎样做？',
    'image': '',
    'options': [
      '立马放烟雾弹',
      '立马找人还击',
      '立马跑起来找掩体'
    ],
    'next': [
      '-4',
      '-3',
      '9'
    ]
  }, {
    'id': 9,
    'title': '一场激战胜利后，你会优先做什么？',
    'image': '',
    'options': [
      '救起倒下的队友',
      '打满血',
      '四处观望'
    ],
    'next': [
      '-4',
      '-2',
      '-1'
    ]
  }],
  'result': [{
    'id': 0,
    'title': '指挥员',
    'content': '指挥员需要有良好的大局观，优秀口语表达能力，物资分配能力和一定战术战略意识，驾驶技术优秀，对游戏理解能力强于他人，会分析眼下问题，读懂敌方意图；战场职责：对于进圈时机的掌握并及时带领团队进入安全区内选点，根据队内角色划分分配相关资源，了解队员个人特长，遭遇战时能最大发挥队伍能力，驾车带领队员及时进行转移，良好掌握战场节奏，个人能力全面，可补位其他队伍角色；'
  }, {
    'id': 1,
    'title': '狙击手',
    'content': '狙击就是要出其不意，那身为一名狙击手要如何做到呢，想要出其不意，那么前提就得你的敌人没有发现你，那么你就要懂得如何隐藏自己，但是碰到挂逼就另当别论了。除了隐藏自己外，一名合格的狙击手还得有很高的爆头率，也就是说你要能够在最短时间内将敌人打倒，所以一名狙击手所要必备的是高精准度。'
  }, {
    'id': 2,
    'title': '突击手',
    'content': '突击手拥有优秀近战刚枪能力，良好走位及迂回意识，遭遇战时良好的反应能力，良好战术执行能力，懂得拉枪线，良好的攻楼能力；听从指挥，善于各类障碍物快速接近敌方，利用迂回战术偷袭敌方，达到一击制敌的效果，利用良好走位吸引火力保护团队；'
  }, {
    'id': 3,
    'title': '医疗兵',
    'content': '医疗兵，可以说是团队里的奶妈职业了，不光是医疗用品，同时还要帮助队友找到需要的配件。在面对倒地的队友时要能够及时的帮助队友，如果是在掩体密集的地方还好，但是在空旷地形的话，医疗兵就得知道正确的使用烟雾弹了。医疗兵不止是帮助队友，其实这个位置需要最全面的综合能力，能够在失去部分队友时做到顶替队友位置的能力。'
  }]
});
db.test.insert({
        "id": 3,
        "image": "/images/island.jpg",
        "intro": "每个人都有自己的性格，每个人都有自己的代表色",
        "question": [
            {
                "id": 0,
                "image": "",
                "next": [
                    "3",
                    "2",
                    "1"
                ],
                "options": [
                    "是的",
                    "不是",
                    "还好"
                ],
                "title": "你的性格比较冷淡？"
            },
            {
                "id": 1,
                "image": "",
                "next": [
                    "4",
                    "3",
                    "2"
                ],
                "options": [
                    "晴天",
                    "雨天",
                    "阴天"
                ],
                "title": "你更喜欢怎样的天气？"
            },
            {
                "id": 2,
                "image": "",
                "next": [
                    "5",
                    "4",
                    "3"
                ],
                "options": [
                    "是的",
                    "不是",
                    "不确定"
                ],
                "title": "你比较注重仪表？"
            },
            {
                "id": 3,
                "image": "",
                "next": [
                    "5",
                    "6",
                    "4"
                ],
                "options": [
                    "是的",
                    "不是",
                    "还好"
                ],
                "title": "你喜欢喝茶吗？"
            },
            {
                "id": 4,
                "image": "",
                "next": [
                    "6",
                    "5",
                    "7"
                ],
                "options": [
                    "是的",
                    "不是",
                    "还好"
                ],
                "title": "你是一个精致的人吗？"
            },
            {
                "id": 5,
                "image": "",
                "next": [
                    "7",
                    "6",
                    "8"
                ],
                "options": [
                    "是的",
                    "不是",
                    "看情况"
                ],
                "title": "你对于金钱使用有规划吗？"
            },
            {
                "id": 6,
                "image": "",
                "next": [
                    "8",
                    "9",
                    "7"
                ],
                "options": [
                    "是的",
                    "不是",
                    "还好"
                ],
                "title": "你是一个完美主义者？"
            },
            {
                "id": 7,
                "image": "",
                "next": [
                    "-1",
                    "8",
                    "9"
                ],
                "options": [
                    "是的",
                    "不是",
                    "还好"
                ],
                "title": "你喜欢笑吗？"
            },
            {
                "id": 8,
                "image": "",
                "next": [
                    "-4",
                    "9",
                    "-3"
                ],
                "options": [
                    "是的",
                    "不是",
                    "还好"
                ],
                "title": "你的泪点很低？"
            },
            {
                "id": 9,
                "image": "",
                "next": [
                    "-5",
                    "-2",
                    "-3"
                ],
                "options": [
                    "有距离感的",
                    "亲切小可爱",
                    "介乎两者之间"
                ],
                "title": "你给人留下的第一印象更可能是："
            }
        ],
        "result": [
            {
                "content": "你是乐观向上的红色型，哪怕遇到不好的事情，也会用积极的方式去面对。在日常生活中，你开朗爱玩，对于自己的人生有很多美好的期望，并且会通过自己的努力去实现。你不甘心成为庸俗平凡的人，希望能获得更多的新鲜体验。",
                "id": 0,
                "title": "红色"
            },
            {
                "content": "你是单纯可爱的黄色型，明媚的暖黄色就像你的性格，不会过分强烈张扬，但是却让人难忘。和你在一起，是相当愉快的体验，你待人友善，常常能得到身边人的喜欢。对于生活，虽然不一定有很强的规划，但你会把日子过得有滋有味。",
                "id": 1,
                "title": "黄色"
            },
            {
                "content": "你是生机勃勃的绿色型。绿色，代表了万物复苏，是充满活力与朝气的颜色。你可能是那种第一次接触并不会让人马上熟悉的人，只有经过长时间的相处，才会发现你的好。你在内心有着自己的想法和态度，属于踏实认真生活的人。",
                "id": 2,
                "title": "绿色"
            },
            {
                "content": "你是神秘莫测的紫色型。紫色是既神秘又张扬的颜色，在别人眼里，你有着独特的魅力，但是却不是那么好接近（也许你也并不希望无谓的人接近你）。你是一个比较有主见，或者说比较自我的人，不会太在意别人的想法。",
                "id": 3,
                "title": "紫色"
            },
            {
                "content":"你是忧郁冷静的蓝色型。你总是将内心的想法隐藏，除非你足够信任对方，否则你不会轻易袒露真实的自己。你既渴望得到别人的了解，又害怕受伤，所以总是尽可能地回避人多的环境，好让自己的心灵得到休息的空间。",
                "id": 4,
                "title": "蓝色"
            }
        ],
        "title": "测试什么颜色是你的代表色",
        "type": "next"
    });
db.test.insert({
        "id": 4,
        "image": "/images/waterdrop.jpg",
        "intro": "每个人对细节的把控都不一样，你是哪一种？",
        "question": [
            {
                "id": 0,
                "image": "",
                "next": [
                    "1",
                    "2",
                    "3"
                ],
                "options": [
                    "是的",
                    "不是",
                    "不确定"
                ],
                "title": "你记得自己的裤围是多少吗？"
            },
            {
                "id": 1,
                "image": "",
                "next": [
                    "4",
                    "3",
                    "2"
                ],
                "options": [
                    "是的",
                    "不是",
                    "差不多"
                ],
                "title": "跟别人比起来，你的桌面比较整洁？"
            },
            {
                "id": 2,
                "image": "",
                "next": [
                    "3",
                    "4",
                    "5"
                ],
                "options": [
                    "是的",
                    "不是",
                    "还好"
                ],
                "title": "你的好奇心很强？"
            },
            {
                "id": 3,
                "image": "",
                "next": [
                    "4",
                    "6",
                    "5"
                ],
                "options": [
                    "结果",
                    "过程",
                    "看情况"
                ],
                "title": "工作的时候你更注重结果还是过程？"
            },
            {
                "id": 4,
                "image": "",
                "next": [
                    "5",
                    "6",
                    "7"
                ],
                "options": [
                    "不太计较",
                    "要求换货",
                    "看情况"
                ],
                "title": "如果你买到的东西上有一个小瑕疵，你会："
            },
            {
                "id": 5,
                "image": "",
                "next": [
                    "8",
                    "6",
                    "7"
                ],
                "options": [
                    "提醒对方",
                    "忍忍算了",
                    "看情况"
                ],
                "title": "在公共场合有人大声吵闹影响到你，你会："
            },
            {
                "id": 6,
                "image": "",
                "next": [
                    "7",
                    "9",
                    "8"
                ],
                "options": [
                    "有",
                    "没有",
                    "看情况"
                ],
                "title": "你有保留聊天记录的习惯吗？"
            },
            {
                "id": 7,
                "image": "",
                "next": [
                    "9",
                    "-3",
                    "8"
                ],
                "options": [
                    "是的",
                    "不是",
                    "看心情"
                ],
                "title": "买东西的时候，你会计算好最优方案？"
            },
            {
                "id": 8,
                "image": "",
                "next": [
                    "-1",
                    "9",
                    "-2"
                ],
                "options": [
                    "找服务员催单",
                    "心想再等等好了",
                    "虽然不耐烦但不会催单"
                ],
                "title": "点餐后过了一段时间，还没有上菜，你会:"
            },
            {
                "id": 9,
                "image": "",
                "next": [
                    "-3",
                    "-1",
                    "-4"
                ],
                "options": [
                    "是",
                    "不是",
                    "不清楚"
                ],
                "title": "你是朋友眼中的话痨？"
            }
        ],
        "result": [
            {
                "content": "你是一个十足的“细节控”，不能忍受不符合自己要求的事物。这样的你常常会希望把事情做得尽善尽美，但有时候，你很可能会因为过于注重细节而迟迟无法做出决定，或因为看重细节而忽略全局，因小失大。",
                "id": 0,
                "title": "细节注重度：★★★★★"
            },
            {
                "content": "你是一个注重细节的人，但无论是在工作上还是生活上，你都会把握一个度，不会过分纠结。在你看来，细节决定成败，但效率也十分重要，你拥有着大局观，不会因为细节而影响整体的进度。",
                "id": 1,
                "title": "细节注重度：★★★★☆"
            },
            {
                "content": "你是一个比较没心没肺的人，不太在意细节。你总是想做什么就去做，在你看来，只要付出行动，就会有收获，太过在意细节反而会打乱你原本的想法，让你畏首畏尾。但从另一方面看，你很可能会发生考虑不周全的情况。",
                "id": 2,
                "title": "细节注重度：★★☆☆☆"
            },
            {
                "content": "你并不是一个十分注重细节的人，面对生活上无关紧要的事情，你大多时候会认为只要自己开心就好，不会有太多的要求。只有在面对一件对你而言比较重要的事时，你才会认真思考和判断各个因素的影响，然后作出决定。",
                "id": 3,
                "title": "细节注重度：★★★☆☆"
            }
        ],
        "title": "测测你到底在意细节吗",
        "type": "next"
    });