use aishangce;
db.test.insert({
'id':0,
'type': 'next',
'image':'/images/000-castle.jpg',
'title':'你在爱情中“受伤率”有多高',
'intro':'爱情中免不了受伤，你会是最容易受伤的哪个吗？',
'question': [{
    'id': 0,
    'title': '你觉得自己运气还不错？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '3',
      '2',
      '1'
    ]}, {
    'id': 1,
    'title': '有人借走你的东西，你会记得吗？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '4',
      '3',
      '2'
    ]}, {
    'id': 2,
    'title': '你赞同爱情里的人都是盲目的吗？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '5',
      '4',
      '3'
    ]}, {
    'id': 3,
    'title': '你的内心情感比较细腻？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '6',
      '5',
      '4'
    ]}, {
    'id': 4,
    'title': '你是一个强势的人吗？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '7',
      '6',
      '5'
    ]}, {
    'id': 5,
    'title': '你曾经暗恋过某个人吗？',
    'image': '',
    'options': [
      '是的，而且不止一个',
      '是的，只有一个',
      '不是'
    ],
    'next': [
      '6',
      '7',
      '-1'
    ]}, {
    'id': 6,
    'title': '你对爱情有很高的期待或者要求？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '8',
      '9',
      '7'
    ]}, {
    'id': 7,
    'title': '有人说过你很敏感？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '-1',
      '8',
      '9'
    ]}, {
    'id': 8,
    'title': '如果和恋人吵架了，你会：',
    'image': '',
    'options': [
      '争论对错',
      '冷战逃避',
      '求和示好'
    ],
    'next': [
      '-1',
      '-2',
      '-3'
    ]}, {
    'id': 9,
    'title': '如果有人（不讨厌也不喜欢）跟你表白，你会：',
    'image': '',
    'options': [
      '答应对方',
      '考虑一下',
      '拒绝对方'
    ],
    'next': [
      '-2',
      '-3',
      '-4'
    ]
  }],
'result': [{
    'id': 0,
    'title': '受伤率：90%',
    'content': '你对于爱情有憧憬和期待，但是爱情中有甜蜜，也会有摩擦。两个不同的个体在一起，不可避免地会有磨合的事情，但是有时候你可能过于敏感，又或者过于执着于自己的态度，而忽略了对方，导致最后的结局往往并不好。为此，你会感到十分受伤。'
  }, {
    'id': 1,
    'title': '受伤率：70%',
    'content': '你在关系中比较有可能会受伤，这可能源于你不太懂得如何去维护关系。你采取的方式对你来说是轻松的，但是对关系来说却未必是有益的，甚至可能会影响关系。如果不想在感情中受伤，你应该正视自己的内心，学会如何去爱，去表达。'
  }, {
    'id': 2,
    'title': '受伤率：50%',
    'content': '你对于爱情抱有比较开放的态度，不会坚持一些固有的观念，而是会敢于尝试，主动迈出第一步。但是爱情有时候并不尽如人意，好在你也明白这一点，并不会强求，面对爱情中可能的伤害也比较看得开，更可能采取积极的方式来解决。'
  }, {
    'id': 3,
    'title': '受伤率：30%',
    'content': '你的受伤率很低，但这来源于你不给对方机会，以此来切断自己受伤的可能。你对爱情可能有着比较消极的想法，不太想进入一段关系，面对爱情，常常是望而却步。然而这样的你，内心并不是真的强大，只是你用围墙把自己保护起来而已。'
  }]
});

db.test.insert({
  'id': 1,
  'image': '/images/001-san_francisco.jpg',
  'title': '你是一个性格多变的人吗',
  'intro': '测一测，别人眼里的你是不是多变的？',
  'question': [{
    'id': 0,
    'title': '你觉得自己运气还不错？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '1',
      '3',
      '2'
    ]
  }, {
    'id': 1,
    'type': 'next',
    'title': '你的性格比较外向？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '一般'
    ],
    'next': [
      '3',
      '2',
      '4'
    ]
  }, {
    'id': 2,
    'title': '你的朋友多吗？',
    'image': '',
    'options': [
      '多',
      '不多',
      '一般'
    ],
    'next': [
      '4',
      '5',
      '3'
    ]
  }, {
    'id': 3,
    'title': '你相信自己有能力面对生活的变化吗？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '6',
      '5',
      '4'
    ]
  }, {
    'id': 4,
    'title': '你有广泛的兴趣爱好？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '6',
      '7',
      '5'
    ]
  }, {
    'id': 5,
    'title': '你的想象力比较丰富？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '还好'
    ],
    'next': [
      '6',
      '7',
      '-3'
    ]
  }, {
    'id': 6,
    'title': '如果你讲出自己真实的一面，别人会相当惊讶？',
    'image': '',
    'options': [
      '是的',
      '不是',
      '不确定'
    ],
    'next': [
      '-2',
      '-1',
      '7'
    ]
  }, {
    'id': 7,
    'title': '如果计划遇到阻滞，你更可能会：',
    'image': '',
    'options': [
      '坚定计划',
      '调整计划',
      '放弃计划'
    ],
    'next': [
      '-4',
      '-3',
      '-1'
    ]
  }],
  'result': [{
    'id': 0,
    'title': '多变指数：★★★★☆',
    'content': '你并不是一个性格多变的人，你的“多变”更多是来源于你的不坚定。你需要得到他人的肯定才会感到安心，才会敢继续下一步。所以有时候，为了迎合别人，你会改变自己的想法和行为。'
  }, {
    'id': 1,
    'title': '多变指数：★★★★★',
    'content': '你灵活多变，对于生活中发生的事情，总是有很多奇思妙想。所以在别人看来，你是一个性格多变的人，常常会用不同寻常的方式。你不喜欢一成不变的生活，总是根据自己喜欢的方式和当下的心情来行动。'
  }, {
    'id': 2,
    'title': '多变指数：★★★☆☆',
    'content': '你并不是一个很多变的人，但是你有着灵活的一面，在不同的时候，不同的人面前，你会适时调整自我，采用不同的方式去对待 。在别人看来，你既稳重，又懂得变通。'
  }, {
    'id': 3,
    'title': '多变指数：★★☆☆☆',
    'content': '你对自己比较有自信，会坚定自己的想法和计划，这样的你比较踏实沉稳，性格并不多变。但值得注意的是，你的自信应该是建立在能力之上的，如果不多多听取别人的意见，你的“一成不变”就会成为别人眼里的固执了。'
  }]
});
db.test.insert({
    'id': 2,
    'type': 'next',
    'image': '/images/002-cornfield.jpg',
    'title': '四排吃鸡，你适合什么位置',
    'intro': '各位鸡友们，还在为自己的位置迷茫吗？',
    'question': [{
        'id': 0,
        'title': '你喜欢怎么搭配枪械？',
        'image': '',
        'options': [
            'M416+AKM',
            'M416+狙击枪',
            'AKM+冲锋枪',
            'AKM+狙击枪'
        ],
        'next': [
            '1',
            '2',
            '1',
            '2'
        ]
    }, {
      'id': 1,
      'title': '自动步枪，你喜欢带多少子弹？',
      'image': '',
      'options': [
        '200发及以下',
        '200发以上'
      ],
      'next': [
        '2',
        '3'
      ]
    }, {
      'id': 2,
      'title': '背包满了，你优先扔掉什么？',
      'image': '',
      'options': [
        '烟雾弹',
        '手雷',
        '急救包',
        '子弹'
      ],
      'next': [
        '4',
        '3',
        '4',
        '3'
      ]
    }, {
      'id': 3,
      'title': '你喜欢当司机还是乘客？',
      'image': '',
      'options': [
        '司机',
        '乘客'
      ],
      'next': [
        '5',
        '4'
      ]
    }, {
      'id': 4,
      'title': '队友被击倒时，你优先做什么？',
      'image': '',
      'options': [
        '灭了敌人',
        '封烟救人'
      ],
      'next': [
        '6',
        '5'
      ]
    }, {
      'id': 5,
      'title': '敌人在守楼时，你会怎么做？',
      'image': '',
      'options': [
        '直接攻楼',
        '扔震爆弹、手雷进去再攻楼',
        '在屋外瞄着，等敌人冒头'
      ],
      'next': [
        '6',
        '7',
        '8'
      ]
    }, {
      'id': 6,
      'title': '半血的三级头和完好的二级头，你会选哪个？',
      'image': '',
      'options': [
        '半血的三级头',
        '完好的二级头'
      ],
      'next': [
        '7',
        '8'
      ]
    }, {
      'id': 7,
      'title': '前方发现敌人时，你会怎么做？',
      'image': '',
      'options': [
        '直接冲上去扫射',
        '等队友先上，自己殿后',
        '远距离放冷枪',
        '躲起来等敌人路过再偷袭'
      ],
      'next': [
        '-3',
        '8',
        '-2',
        '9'
      ]
    }, {
      'id': 8,
      'title': '当你受到攻击时，你会怎样做？',
      'image': '',
      'options': [
        '立马放烟雾弹',
        '立马找人还击',
        '立马跑起来找掩体'
      ],
      'next': [
        '-4',
        '-3',
        '9'
      ]
    }, {
      'id': 9,
      'title': '一场激战胜利后，你会优先做什么？',
      'image': '',
      'options': [
        '救起倒下的队友',
        '打满血',
        '四处观望'
      ],
      'next': [
        '-4',
        '-2',
        '-1'
      ]
    }],
    'result': [{
      'id': 0,
      'title': '指挥员',
      'content': '指挥员需要有良好的大局观，优秀口语表达能力，物资分配能力和一定战术战略意识，驾驶技术优秀，对游戏理解能力强于他人，会分析眼下问题，读懂敌方意图；战场职责：对于进圈时机的掌握并及时带领团队进入安全区内选点，根据队内角色划分分配相关资源，了解队员个人特长，遭遇战时能最大发挥队伍能力，驾车带领队员及时进行转移，良好掌握战场节奏，个人能力全面，可补位其他队伍角色；'
    }, {
      'id': 1,
      'title': '狙击手',
      'content': '狙击就是要出其不意，那身为一名狙击手要如何做到呢，想要出其不意，那么前提就得你的敌人没有发现你，那么你就要懂得如何隐藏自己，但是碰到挂逼就另当别论了。除了隐藏自己外，一名合格的狙击手还得有很高的爆头率，也就是说你要能够在最短时间内将敌人打倒，所以一名狙击手所要必备的是高精准度。'
    }, {
      'id': 2,
      'title': '突击手',
      'content': '突击手拥有优秀近战刚枪能力，良好走位及迂回意识，遭遇战时良好的反应能力，良好战术执行能力，懂得拉枪线，良好的攻楼能力；听从指挥，善于各类障碍物快速接近敌方，利用迂回战术偷袭敌方，达到一击制敌的效果，利用良好走位吸引火力保护团队；'
    }, {
      'id': 3,
      'title': '医疗兵',
      'content': '医疗兵，可以说是团队里的奶妈职业了，不光是医疗用品，同时还要帮助队友找到需要的配件。在面对倒地的队友时要能够及时的帮助队友，如果是在掩体密集的地方还好，但是在空旷地形的话，医疗兵就得知道正确的使用烟雾弹了。医疗兵不止是帮助队友，其实这个位置需要最全面的综合能力，能够在失去部分队友时做到顶替队友位置的能力。'
    }]
});
db.test.insert({
    "id": 3,
    "image": "/images/003-island.jpg",
    "intro": "每个人都有自己的性格，每个人都有自己的代表色",
    "question": [
        {
            "id": 0,
            "image": "",
            "next": [
                "3",
                "2",
                "1"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "你的性格比较冷淡？"
        },
        {
            "id": 1,
            "image": "",
            "next": [
                "4",
                "3",
                "2"
            ],
            "options": [
                "晴天",
                "雨天",
                "阴天"
            ],
            "title": "你更喜欢怎样的天气？"
        },
        {
            "id": 2,
            "image": "",
            "next": [
                "5",
                "4",
                "3"
            ],
            "options": [
                "是的",
                "不是",
                "不确定"
            ],
            "title": "你比较注重仪表？"
        },
        {
            "id": 3,
            "image": "",
            "next": [
                "5",
                "6",
                "4"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "你喜欢喝茶吗？"
        },
        {
            "id": 4,
            "image": "",
            "next": [
                "6",
                "5",
                "7"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "你是一个精致的人吗？"
        },
        {
            "id": 5,
            "image": "",
            "next": [
                "7",
                "6",
                "8"
            ],
            "options": [
                "是的",
                "不是",
                "看情况"
            ],
            "title": "你对于金钱使用有规划吗？"
        },
        {
            "id": 6,
            "image": "",
            "next": [
                "8",
                "9",
                "7"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "你是一个完美主义者？"
        },
        {
            "id": 7,
            "image": "",
            "next": [
                "-1",
                "8",
                "9"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "你喜欢笑吗？"
        },
        {
            "id": 8,
            "image": "",
            "next": [
                "-4",
                "9",
                "-3"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "你的泪点很低？"
        },
        {
            "id": 9,
            "image": "",
            "next": [
                "-5",
                "-2",
                "-3"
            ],
            "options": [
                "有距离感的",
                "亲切小可爱",
                "介乎两者之间"
            ],
            "title": "你给人留下的第一印象更可能是："
        }
    ],
    "result": [
        {
            "content": "你是乐观向上的红色型，哪怕遇到不好的事情，也会用积极的方式去面对。在日常生活中，你开朗爱玩，对于自己的人生有很多美好的期望，并且会通过自己的努力去实现。你不甘心成为庸俗平凡的人，希望能获得更多的新鲜体验。",
            "id": 0,
            "title": "红色"
        },
        {
            "content": "你是单纯可爱的黄色型，明媚的暖黄色就像你的性格，不会过分强烈张扬，但是却让人难忘。和你在一起，是相当愉快的体验，你待人友善，常常能得到身边人的喜欢。对于生活，虽然不一定有很强的规划，但你会把日子过得有滋有味。",
            "id": 1,
            "title": "黄色"
        },
        {
            "content": "你是生机勃勃的绿色型。绿色，代表了万物复苏，是充满活力与朝气的颜色。你可能是那种第一次接触并不会让人马上熟悉的人，只有经过长时间的相处，才会发现你的好。你在内心有着自己的想法和态度，属于踏实认真生活的人。",
            "id": 2,
            "title": "绿色"
        },
        {
            "content": "你是神秘莫测的紫色型。紫色是既神秘又张扬的颜色，在别人眼里，你有着独特的魅力，但是却不是那么好接近（也许你也并不希望无谓的人接近你）。你是一个比较有主见，或者说比较自我的人，不会太在意别人的想法。",
            "id": 3,
            "title": "紫色"
        },
        {
            "content":"你是忧郁冷静的蓝色型。你总是将内心的想法隐藏，除非你足够信任对方，否则你不会轻易袒露真实的自己。你既渴望得到别人的了解，又害怕受伤，所以总是尽可能地回避人多的环境，好让自己的心灵得到休息的空间。",
            "id": 4,
            "title": "蓝色"
        }
    ],
    "title": "测试什么颜色是你的代表色",
    "type": "next"
});
db.test.insert({
    "id": 4,
    "image": "/images/004-waterdrop.jpg",
    "intro": "每个人对细节的把控都不一样，你是哪一种？",
    "question": [
        {
            "id": 0,
            "image": "",
            "next": [
                "1",
                "2",
                "3"
            ],
            "options": [
                "是的",
                "不是",
                "不确定"
            ],
            "title": "你记得自己的裤围是多少吗？"
        },
        {
            "id": 1,
            "image": "",
            "next": [
                "4",
                "3",
                "2"
            ],
            "options": [
                "是的",
                "不是",
                "差不多"
            ],
            "title": "跟别人比起来，你的桌面比较整洁？"
        },
        {
            "id": 2,
            "image": "",
            "next": [
                "3",
                "4",
                "5"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "你的好奇心很强？"
        },
        {
            "id": 3,
            "image": "",
            "next": [
                "4",
                "6",
                "5"
            ],
            "options": [
                "结果",
                "过程",
                "看情况"
            ],
            "title": "工作的时候你更注重结果还是过程？"
        },
        {
            "id": 4,
            "image": "",
            "next": [
                "5",
                "6",
                "7"
            ],
            "options": [
                "不太计较",
                "要求换货",
                "看情况"
            ],
            "title": "如果你买到的东西上有一个小瑕疵，你会："
        },
        {
            "id": 5,
            "image": "",
            "next": [
                "8",
                "6",
                "7"
            ],
            "options": [
                "提醒对方",
                "忍忍算了",
                "看情况"
            ],
            "title": "在公共场合有人大声吵闹影响到你，你会："
        },
        {
            "id": 6,
            "image": "",
            "next": [
                "7",
                "9",
                "8"
            ],
            "options": [
                "有",
                "没有",
                "看情况"
            ],
            "title": "你有保留聊天记录的习惯吗？"
        },
        {
            "id": 7,
            "image": "",
            "next": [
                "9",
                "-3",
                "8"
            ],
            "options": [
                "是的",
                "不是",
                "看心情"
            ],
            "title": "买东西的时候，你会计算好最优方案？"
        },
        {
            "id": 8,
            "image": "",
            "next": [
                "-1",
                "9",
                "-2"
            ],
            "options": [
                "找服务员催单",
                "心想再等等好了",
                "虽然不耐烦但不会催单"
            ],
            "title": "点餐后过了一段时间，还没有上菜，你会:"
        },
        {
            "id": 9,
            "image": "",
            "next": [
                "-3",
                "-1",
                "-4"
            ],
            "options": [
                "是",
                "不是",
                "不清楚"
            ],
            "title": "你是朋友眼中的话痨？"
        }
    ],
    "result": [
        {
            "content": "你是一个十足的“细节控”，不能忍受不符合自己要求的事物。这样的你常常会希望把事情做得尽善尽美，但有时候，你很可能会因为过于注重细节而迟迟无法做出决定，或因为看重细节而忽略全局，因小失大。",
            "id": 0,
            "title": "细节注重度：★★★★★"
        },
        {
            "content": "你是一个注重细节的人，但无论是在工作上还是生活上，你都会把握一个度，不会过分纠结。在你看来，细节决定成败，但效率也十分重要，你拥有着大局观，不会因为细节而影响整体的进度。",
            "id": 1,
            "title": "细节注重度：★★★★☆"
        },
        {
            "content": "你是一个比较没心没肺的人，不太在意细节。你总是想做什么就去做，在你看来，只要付出行动，就会有收获，太过在意细节反而会打乱你原本的想法，让你畏首畏尾。但从另一方面看，你很可能会发生考虑不周全的情况。",
            "id": 2,
            "title": "细节注重度：★★☆☆☆"
        },
        {
            "content": "你并不是一个十分注重细节的人，面对生活上无关紧要的事情，你大多时候会认为只要自己开心就好，不会有太多的要求。只有在面对一件对你而言比较重要的事时，你才会认真思考和判断各个因素的影响，然后作出决定。",
            "id": 3,
            "title": "细节注重度：★★★☆☆"
        }
    ],
    "title": "测测你到底在意细节吗",
    "type": "next"
});
db.test.insert({
    "id": 5,
    "image": "/images/005-barnimages.jpg",
    "intro": "人际关系中，你是被动型还是主动型？",
    "question": [
        {
            "id": 0,
            "image": "",
            "next": [
                "1",
                "2",
                "3"
            ],
            "options": [
                "是的",
                "不是",
                "看情况"
            ],
            "title": "比起聚会，你更喜欢自己一个人静静？"
        },
        {
            "id": 1,
            "image": "",
            "next": [
                "2",
                "3",
                "4"
            ],
            "options": [
                "是的",
                "没有",
                "不确定"
            ],
            "title": "你有无缘由讨厌的人吗？"
        },
        {
            "id": 2,
            "image": "",
            "next": [
                "3",
                "4",
                "5",
                "6"
            ],
            "options": [
                "春季",
                "夏季",
                "秋季",
                "冬季"
            ],
            "title": "你更喜欢哪个季节？"
        },
        {
            "id": 3,
            "image": "",
            "next": [
                "4",
                "5",
                "6"
            ],
            "options": [
                "会",
                "不会",
                "还好"
            ],
            "title": "身边的人出双入对的，你会觉得羡慕吗？"
        },
        {
            "id": 4,
            "image": "",
            "next": [
                "5",
                "6",
                "7"
            ],
            "options": [
                "是的",
                "不是",
                "一般"
            ],
            "title": "你是一个浪漫主义者吗？"
        },
        {
            "id": 5,
            "image": "",
            "next": [
                "6",
                "7",
                "-4"
            ],
            "options": [
                "一次都没有",
                "一两次",
                "三次及以上"
            ],
            "title": "你谈过几次恋爱？"
        },
        {
            "id": 6,
            "image": "",
            "next": [
                "8",
                "9",
                "7"
            ],
            "options": [
                "急性子",
                "慢性子",
                "介于两者之间"
            ],
            "title": "你是急性子还是慢性子？"
        },
        {
            "id": 7,
            "image": "",
            "next": [
                "-2",
                "9",
                "8"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "别人说过你很保守吗？"
        },
        {
            "id": 8,
            "image": "",
            "next": [
                "-2",
                "-3",
                "-1"
            ],
            "options": [
                "看电影",
                "逛街",
                "户外运动"
            ],
            "title": "如果外出娱乐活动，你会选择：:"
        },
        {
            "id": 9,
            "image": "",
            "next": [
                "-2",
                "-4",
                "-1"
            ],
            "options": [
                "稳重的",
                "高冷的",
                "亲近的"
            ],
            "title": "下面三个人，你对谁更有好感？"
        }
    ],
    "result": [
        {
            "content": "你觉得如果真的喜欢对方，男女双方谁主动并不重要。不过，虽然你是这么认为的，但是不一定会主动。如果真的遇到喜欢的人，你也会做出一些暗示，希望对方能感受到，不用你明说出来，追求心仪的对象对你来说还是比较困难的。",
            "id": 0,
            "title": "表面主动内心被动型"
        },
        {
            "content": "你并不擅长主动哦，你是比较传统的人，不是很懂恋爱招数什么的。所以通常情况下，你会以最普遍的方式来发展恋情，不会太刺激但基本不会出错的那种。不过对你来说，细水长流的关系更适合你，你不擅长应对太热烈的人和关系。",
            "id": 1,
            "title": "被动型"
        },
        {
            "content": "如果遇到喜欢的人，你不会在意主动还是被动，会看情况来进行。你很可能会先暗中观察一番，确定对方的情况（例如有没有对象，跟你有没有可能等等），再决定要不要主动。如果对方是慢半拍的人，你就会充当主动的角色了。",
            "id": 2,
            "title": "综合型"
        },
        {
            "content": "遇到喜欢的人，你会主动地引起对方的注意。可以说你是一个敢于面对感情和挑战的人，所以即使在感情中遭遇挫折，也能很快恢复，一段失败的恋情并不会阻挡你追求美好爱情的脚步。",
            "id": 3,
            "title": "主动型"
        }
    ],
    "title": "测测你是被动型还是主动型",
    "type": "next"
});
db.test.insert({
    "id": 6,
    "image": "/images/006-barnimages.jpg",
    "intro": "实力很重要，运气也很重要！",
    "question": [
        {
            "id": 0,
            "image": "",
            "next": [
                "1",
                "2",
                "3"
            ],
            "options": [
                "是的",
                "不是",
                "不确定"
            ],
            "title": "你相信命运吗？"
        },
        {
            "id": 1,
            "image": "",
            "next": [
                "2",
                "3",
                "4"
            ],
            "options": [
                "是的",
                "没有",
                "偶尔"
            ],
            "title": "你常常做发财梦？"
        },
        {
            "id": 2,
            "image": "",
            "next": [
                "3",
                "4",
                "5"
            ],
            "options": [
                "聪明的人",
                "努力的人",
                "既聪明又努力，但程度都不及以上两者"
            ],
            "title": "你更可能喜欢什么样的人？"
        },
        {
            "id": 3,
            "image": "",
            "next": [
                "4",
                "5",
                "6"
            ],
            "options": [
                "麋鹿",
                "狐狸",
                "天鹅"
            ],
            "title": "你更喜欢哪种动物？"
        },
        {
            "id": 4,
            "image": "",
            "next": [
                "7",
                "6",
                "5"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "你是一个喜欢幻想的人吗？"
        },
        {
            "id": 5,
            "image": "",
            "next": [
                "6",
                "7",
                "-1"
            ],
            "options": [
                "同情心",
                "责任感",
                "领导力"
            ],
            "title": "你觉得什么品质更重要？"
        },
        {
            "id": 6,
            "image": "",
            "next": [
                "7",
                "8",
                "9"
            ],
            "options": [
                "独立完成",
                "团队合作",
                "看情况"
            ],
            "title": "你更愿意："
        },
        {
            "id": 7,
            "image": "",
            "next": [
                "8",
                "-1",
                "9"
            ],
            "options": [
                "是的",
                "不是",
                "偶尔"
            ],
            "title": "你常常对生活感到迷茫？"
        },
        {
            "id": 8,
            "image": "",
            "next": [
                "-3",
                "-2",
                "9"
            ],
            "options": [
                "冒险派",
                "保守派",
                "介于两者之间"
            ],
            "title": "相比之下，你更倾向于："
        },
        {
            "id": 9,
            "image": "",
            "next": [
                "-2",
                "-3",
                "-4"
            ],
            "options": [
                "诗人",
                "侠客",
                "布衣"
            ],
            "title": "如果穿越到古代，你希望自己的身份是："
        }
    ],
    "result": [
        {
            "content": "你是靠实力说话的人。你目标比较清晰，清楚自己想要什么，而且一旦决定了，你就会通过自己的努力去获得去争取。运气对你来说只是一种加成，对你来说，机会是留给有准备的人的，所以你并不会寄希望于运气。",
            "id": 0,
            "title": "实力：★★★★☆ 运气：★★☆☆☆"
        },
        {
            "content": "只能说你还是蛮幸运的吧，生活对你还算不错。一路走来还算顺利，没发生什么大灾大难，即使偶尔会遇到困难和挫折，你也能迎刃而解。运气好，自然是值得开心的事，但运气不好的时候，希望你也懂得靠自己去破解难题哦",
            "id": 1,
            "title": "实力：★★☆☆☆ 运气：★★★★☆"
        },
        {
            "content": "对你来说，生活就那么一回事，虽然不简单，但不用把它想得太复杂，兵来将挡水来土掩罢了。有运气当然是好事，但是你并不会指望自己的运气能够帮助自己什么，或者说你根本不会刻意去思考是不是自己运气的问题，只觉得一步步往前走就是了。",
            "id": 2,
            "title": "实力：★★★★☆ 运气：★★★☆☆"
        },
        {
            "content": "你的运气普普通通，也许曾经碰到过好的机会或贵人相助。尽管你希望事情会往好的方向发展，但是你并不相信自己的运气靠得住，所以很多时候你还是会做两手准备，靠实力来解决问题。",
            "id": 3,
            "title": "实力：★★★☆☆ 运气：★★★☆☆"
        }
    ],
    "title": "运气和实力，哪个是你的菜",
    "type": "next"
});
db.test.insert({
    "id": 7,
    "image": "/images/007-barnimages.jpg",
    "intro": "在爱情中，我们更要清楚自己的弱点",
    "question": [
        {
            "id": 0,
            "image": "",
            "next": [
                "1",
                "2",
                "3"
            ],
            "options": [
                "玩手机",
                "看剧",
                "看书"
            ],
            "title": "在家的闲暇时间，你更可能怎样打发时间？"
        },
        {
            "id": 1,
            "image": "",
            "next": [
                "4",
                "3",
                "2"
            ],
            "options": [
                "有",
                "没有",
                "不确定"
            ],
            "title": "（现实生活中）你现在有喜欢的人吗？"
        },
        {
            "id": 2,
            "image": "",
            "next": [
                "5",
                "4",
                "3"
            ],
            "options": [
                "是的",
                "不是",
                "不确定"
            ],
            "title": "你对待感情专一吗？"
        },
        {
            "id": 3,
            "image": "",
            "next": [
                "6",
                "5",
                "4"
            ],
            "options": [
                "清淡的",
                "重口味的",
                "介于两者之间"
            ],
            "title": "你喜欢哪一类食物？"
        },
        {
            "id": 4,
            "image": "",
            "next": [
                "7",
                "6",
                "5"
            ],
            "options": [
                "非常伤心",
                "非常生气",
                "其它"
            ],
            "title": "当你发现恋人欺骗了你，你会："
        },
        {
            "id": 5,
            "image": "",
            "next": [
                "6",
                "7",
                "8"
            ],
            "options": [
                "是的",
                "不是",
                "一般"
            ],
            "title": "你的桃花运还不错？"
        },
        {
            "id": 6,
            "image": "",
            "next": [
                "7",
                "8",
                "9"
            ],
            "options": [
                "好",
                "不好",
                "一般"
            ],
            "title": "你觉得自己的脾气好吗？"
        },
        {
            "id": 7,
            "image": "",
            "next": [
                "-1",
                "-2",
                "9"
            ],
            "options": [
                "再三思考，难以抉择",
                "果断决定，很少后悔",
                "介于两者之间"
            ],
            "title": "做选择时，你常常会："
        },
        {
            "id": 8,
            "image": "",
            "next": [
                "9",
                "-2",
                "-3"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "你是一个自私的人吗？"
        },
        {
            "id": 9,
            "image": "",
            "next": [
                "-4",
                "-3",
                "-1"
            ],
            "options": [
                "是的",
                "不是",
                "不确定"
            ],
            "title": "你很难拒绝别人的要求？"
        }
    ],
    "result": [
        {
            "content": "你是一个容易犹豫和执着的人，在很多事情上，你总会想这是不是最好的方式，是不是最好的结果。哪怕做出了决定，事情已经来不及回头了，你还是会怀疑和纠结。这样的你不仅让自己焦虑，也容易让身边的人感到疲惫。太过执着很可能会让你和恋人心生缝隙，引发争吵，遇到问题时不妨看开些吧。",
            "id": 0,
            "title": "太过执着"
        },
        {
            "content": "你是一个很直接的人，说做就做，不会去想太多后果。对于恋爱也是如此，你是以一种简单的想法来对待恋人的，不希望感情中有太多猜疑，你会觉得那样十分麻烦。但是你的乐观应该是建立在彼此真诚信任的基础上的，否则你的乐天会成为别人伤害你的借口。",
            "id": 1,
            "title": "太过乐天"
        },
        {
            "content": "你是一个为自己而活的人，恋爱对你来说是生活的调味品，如果这个调味品味道不好，你会选择换了它。从某种程度来说，你的这种生活方式让你过的豁达而自由，但是另一方面也有可能让你的恋人感到不被重视。",
            "id": 2,
            "title": "太过自我"
        },
        {
            "content": "你渴望得到别人的喜欢和肯定，所以可能会为了讨好别人，而委曲自己。但是不对等的爱情是不会长久的，你的付出一定是要建立在对方懂得珍惜并回报的前提上，否则你的付出不仅让你觉得累，也不可能得到对方的尊重，最终只会让自己在感情中受伤。",
            "id": 3,
            "title": "太过迁就"
        }
    ],
    "title": "1分钟测出你的爱情弱点是什么",
    "type": "next"
});
db.test.insert({
    "id": 8,
    "image": "/images/008-barnimages.jpg",
    "intro": "潜藏于你内心的，到底是天使还是恶魔？",
    "question": [
        {
            "id": 0,
            "image": "",
            "next": [
                "3",
                "2",
                "1"
            ],
            "options": [
                "是的",
                "不是",
                "一般"
            ],
            "title": "你的童年快乐吗？"
        },
        {
            "id": 1,
            "image": "",
            "next": [
                "4",
                "3",
                "2"
            ],
            "options": [
                "疲惫的",
                "愉快的",
                "其它"
            ],
            "title": "你觉得目前的生活状态："
        },
        {
            "id": 2,
            "image": "",
            "next": [
                "5",
                "4",
                "3"
            ],
            "options": [
                "找到当事人辩解",
                "不想理会，清者自清",
                "想解释却又不知道怎么办好"
            ],
            "title": "如果被别人误解，你会："
        },
        {
            "id": 3,
            "image": "",
            "next": [
                "6",
                "5",
                "4"
            ],
            "options": [
                "有",
                "没有",
                "不确定"
            ],
            "title": "你嫉妒过自己的好朋友吗？"
        },
        {
            "id": 4,
            "image": "",
            "next": [
                "6",
                "7",
                "5"
            ],
            "options": [
                "有",
                "没有",
                "不确定"
            ],
            "title": "你有没有因爱生恨过？"
        },
        {
            "id": 5,
            "image": "",
            "next": [
                "7",
                "8",
                "6"
            ],
            "options": [
                "是的，泪点很低",
                "不是，不容易哭",
                "还好，要看是什么电影"
            ],
            "title": "看感人的电影时，你总是很容易动容流泪？"
        },
        {
            "id": 6,
            "image": "",
            "next": [
                "7",
                "8",
                "9"
            ],
            "options": [
                "是的",
                "没有",
                "还好"
            ],
            "title": "别人说过你很贴心？"
        },
        {
            "id": 7,
            "image": "",
            "next": [
                "8",
                "9",
                "-1"
            ],
            "options": [
                "睡一觉",
                "打游戏",
                "做运动"
            ],
            "title": "不开心的时候，你会做些什么让自己好起来？"
        },
        {
            "id": 8,
            "image": "",
            "next": [
                "-2",
                "-3",
                "9"
            ],
            "options": [
                "是的",
                "不是",
                "还好"
            ],
            "title": "从小到大，你在别人眼里是一个乖孩子？"
        },
        {
            "id": 9,
            "image": "",
            "next": [
                "-2",
                "-3",
                "-4"
            ],
            "options": [
                "太惨了，安慰一下",
                "真替朋友感到丢脸",
                "哈哈哈哈哈哈哈哈"
            ],
            "title": "朋友在群里讲述了一件自己今天做的糗事，你的反应是："
        }
    ],
    "result": [
        {
            "content": "你内心充满阳光，总是能够调用自己的正能量去面对生活中的逆境，即使遇到不开心的事，也会采用积极的方式来缓解不安的心情。而且你不仅能让自己变得开心，还会让身边的人感受到舒心，内心柔软而善良的你相信一切美好的事物，共情能力很强，会尽可能地对身边的人好，俨然是超可爱的天使了。",
            "id": 0,
            "title": "大天使"
        },
        {
            "content": "你治愈而温暖，在很多人眼里，常常是乖巧的模样。你会用自己的善意去对待身边的人，让他人感受到很多安慰。但对于自己的事，你却不太想麻烦或者影响别人，很多时候，你会把自己的苦恼藏在心里，慢慢自己消化。",
            "id": 1,
            "title": "小天使"
        },
        {
            "content": "你是喜欢使坏的人，这并不是说你会做什么坏事，而是你喜欢用戏谑的方式来对待人或事。你的内心有着恶魔的一面，喜欢捉弄别人，看到别人恼羞的时候，你会觉得内心暗爽。不过你还是懂得分寸的，常常是调戏别人又适可而止，不会开过分的玩笑。",
            "id": 2,
            "title": "小恶魔"
        },
        {
            "content": "我跟你suo，你这样很容易会被人打死的。我让你哈哈哈哈哈哈哈哈！你的朋友对待你的种种行为，常常是想打你却又没办法，好气哦却还是要保持微笑的那种。不过，你属于比较没心没肺的人，和你在一起通常都是充满笑料的。遇上性格相投的朋友，大家一起斗嘴打闹，还是非常愉快的！",
            "id": 3,
            "title": "请问——你是魔鬼吗？"
        }
    ],
    "title": "你的内心深处到底住着什么",
    "type": "next"
});
db.test.insert({
    "id": 9,
    "image": "/images/009-barnimages.jpg",
    "intro": "每一段感情，都会出现各种各样的问题。",
    "question": [
        {
            "id": 0,
            "image": "",
            "next": [
                "2",
                "1"
            ],
            "options": [
                "是的，我经常走错路",
                "不是"
            ],
            "title": "你觉得自己算得上是一个路痴吗？"
        },
        {
            "id": 1,
            "image": "",
            "next": [
                "2",
                "3"
            ],
            "options": [
                "是的",
                "不是"
            ],
            "title": "你是一个宿命论者吗？"
        },
        {
            "id": 2,
            "image": "",
            "next": [
                "4",
                "5",
                "3"
            ],
            "options": [
                "扔掉",
                "找出是谁，还给她",
                "收下"
            ],
            "title": "当你收到一个不知道是谁送来的礼物时，你会？"
        },
        {
            "id": 3,
            "image": "",
            "next": [
                "4",
                "5"
            ],
            "options": [
                "会",
                "不会"
            ],
            "title": "在电影散场的时候，你的内心会感到落空吗？"
        },
        {
            "id": 4,
            "image": "",
            "next": [
                "6",
                "5"
            ],
            "options": [
                "喜欢",
                "不喜欢"
            ],
            "title": "你喜欢梁静茹式的情歌吗？"
        },
        {
            "id": 5,
            "image": "",
            "next": [
                "6",
                "7"
            ],
            "options": [
                "是的",
                "不是"
            ],
            "title": "你觉得自己是一个艺术天赋很强的人吗？"
        },
        {
            "id": 6,
            "image": "",
            "next": [
                "9",
                "7",
                "8"
            ],
            "options": [
                "黑猫",
                "白猫",
                "花猫"
            ],
            "title": "如果朋友要送给你一只宠物猫，你会选择什么花色呢？"
        },
        {
            "id": 7,
            "image": "",
            "next": [
                "9",
                "8"
            ],
            "options": [
                "会",
                "不会"
            ],
            "title": "当你有吃醋的念头时，你会表现出来吗？"
        },
        {
            "id": 8,
            "image": "",
            "next": [
                "-4",
                "9"
            ],
            "options": [
                "是的",
                "不是"
            ],
            "title": "你觉得自己算得上是一个观察入微的人吗？"
        },
        {
            "id": 9,
            "image": "",
            "next": [
                "-1",
                "-3",
                "-2"
            ],
            "options": [
                "一个伴侣",
                "一张地图",
                "一部车子"
            ],
            "title": "当你一个人在森林中迷路时，你会希望得到一件什么东西？"
        }
    ],
    "result": [
        {
            "content": "你是一个重感情的人，一旦谈恋爱，会不顾一切的对另一半好。因此，你很难从一段感情中走出来。即使已经重新开始一段恋情，也会不自觉地把现任和前任作比较。甚至会设想，如果当初两人没有分开，现在会是什么样的光景。所以，当你和现任发生矛盾时，就会翻看以往感情中的纪念品，想要借此来逃避现实。但这样做，并不利于解决现在发生的矛盾，甚至会使你陷入以往美好的回忆中无法自拔。回忆总是美好的，但是再美好的过去也不如如今身旁的人。所以，别再让你的过去阻碍现在的恋情。",
            "id": 0,
            "title": "以往的恋情"
        },
        {
            "content": "你是一个特别讨厌被束缚的人，从未想过要为任何人改变自己。你觉得爱情虽然美好，但拥有独立人格的自己才是最重要的。所以，你不想限制自己的发展。每当生活中出现任何选择的时候，你并不会太过顾虑身边人的想法。你只需要考虑的是，自己到底想不想做这件事。因此，你能力出众，很少需要别人的帮助。但在爱情里，注重自由的你就会很容易伤害到对方，使自己的感情发展受阻。一段感情本来就需要双方付出精力去共同维持，如果其中一方始终只考虑自己的未来，那两人能一直走下去的可能性就不大。",
            "id": 1,
            "title": "自由的灵魂"
        },
        {
            "content": "你是一个对自己没有信心的人，在感情里比较患得患失。总是害怕自己的付出对方看不见，害怕对方会做一些伤害你的事情。所以，你很敏感，可能对方表现出一点点不同你就会草木皆兵。根据一些蛛丝马迹就能脑补出一场大戏，然后自己越想越伤心，越想越委屈。因此，你们的感情并不牢固。一旦出现了一点小问题，都有可能变成大矛盾。而你也不知道该如何正面去解决，只能找朋友倾诉烦恼。但实际上，没有一段感情是完美的，你并不需要过于担忧两人之间的矛盾。整日惶惶不安，无论是对自己还是对身边的人都是一种折磨。",
            "id": 2,
            "title": "消极的爱情观"
        },
        {
            "content": "你是一个情感很细腻的人，很容易就能感受到别人的情绪变化。所以你察言观色的本领很强，基本上不会踩到别人的雷区。在他人的眼中，是一个很体贴的人。但也由于这一点，你的心情很容易就会受到亲近的人影响。同时，你并不能很快就消化好那些负面的情绪。如果你的伴侣是一个比较暴脾气的人，即使Ta发火的对象不是你，你在身旁都会觉得很难受，因此无法和Ta继续待在同一空间里。但这并不是你或者对方的问题，每个人都会有自己的脾气，谈恋爱就是一个互相磨合的过程。但如果实在磨合不了，也不用委屈自己继续承受。",
            "id": 3,
            "title": "不稳定的情绪"
        }
    ],
    "title": "你的爱情里最大的阻碍是什么",
    "type": "next"
});
db.test.insert({
        "id": 10,
        "image": "https://bestbwzs.com/image/010-barnimages.jpg",
        "intro": "在别人眼中自己，有着怎样的性格特质呢",
        "question": [
            {
                "id": 0,
                "image": "",
                "next": [
                    "1",
                    "2",
                    "3"
                ],
                "options": [
                    "是的",
                    "不是",
                    "还好"
                ],
                "title": "你常常压抑自己的内心？"
            },
            {
                "id": 1,
                "image": "",
                "next": [
                    "2",
                    "3",
                    "4"
                ],
                "options": [
                    "是的",
                    "不是",
                    "还好"
                ],
                "title": "你是一个比较开朗的人吗？"
            },
            {
                "id": 2,
                "image": "",
                "next": [
                    "3",
                    "4",
                    "5"
                ],
                "options": [
                    "喜欢",
                    "不喜欢",
                    "不确定"
                ],
                "title": "你喜欢现在的自己吗？"
            },
            {
                "id": 3,
                "image": "",
                "next": [
                    "4",
                    "5",
                    "6"
                ],
                "options": [
                    "满意",
                    "不满意",
                    "还好"
                ],
                "title": "你对现在的生活满意吗？"
            },
            {
                "id": 4,
                "image": "",
                "next": [
                    "5",
                    "6",
                    "7"
                ],
                "options": [
                    "是的",
                    "不是",
                    "不确定"
                ],
                "title": "你现在的想法越来越实际了？"
            },
            {
                "id": 5,
                "image": "",
                "next": [
                    "6",
                    "7",
                    "-1"
                ],
                "options": [
                    "游记",
                    "影评",
                    "日记"
                ],
                "title": "你更可能写："
            },
            {
                "id": 6,
                "image": "",
                "next": [
                    "7",
                    "8",
                    "9"
                ],
                "options": [
                    "有",
                    "没有",
                    "有，但还好"
                ],
                "title": "有人曾经说谎伤到了你？"
            },
            {
                "id": 7,
                "image": "",
                "next": [
                    "-1",
                    "-2",
                    "8"
                ],
                "options": [
                    "是的",
                    "不是",
                    "不确定"
                ],
                "title": "你觉得自己挺聪明的？"
            },
            {
                "id": 8,
                "image": "",
                "next": [
                    "-3",
                    "-2",
                    "9"
                ],
                "options": [
                    "下雨",
                    "下雪",
                    "其它"
                ],
                "title": "你更喜欢哪种天气？"
            },
            {
                "id": 9,
                "image": "",
                "next": [
                    "-3",
                    "-2",
                    "-4"
                ],
                "options": [
                    "忧郁",
                    "澄清",
                    "广阔"
                ],
                "title": "你觉得蓝色给你的第一感觉是？"
            }
        ],
        "result": [
            {
                "content": "在别人眼里，你是一个有能力的人。也许你并不是那种锋芒毕露的人，但是只要和你深入地交谈，就会领略到你的才华。在你的内心里是有骄傲的成分的，不愿意与世俗同流，所以在大多数人眼里，又会有些距离感。",
                "id": 0,
                "title": "才华"
            },
            {
                "content": "在别人眼里，你率真可爱，有着独特的个人魅力。你待人友好而真诚，总是用善良的眼光去探索这个世界，很少甚至从不掩饰自己的内心。折让人觉得和你在一起很轻松愉快，可以真实地做自己。",
                "id": 1,
                "title": "率真"
            },
            {
                "content": "在别人眼里，你是一个内敛的人，对于人或事，总是淡淡然，不太会去主动争取，做抛头露面的事情。你可能比较懒，只想安静地生活不受打扰，这样的你在与人相处的时候更常充当倾听的角色，会让人感觉到舒服。",
                "id": 2,
                "title": "内敛"
            },
            {
                "content": "在别人眼里，你是一个现实的人。你不喜欢不切实际的幻想，对于自己分内事总是认认真真地完成。你会是一个很好的同事，和你沟通往往是和直接爽快的。但是作为恋爱对象，有时候你会显得不解风情，没有情趣。",
                "id": 3,
                "title": "现实"
            }
        ],
        "title": "在别人眼里你是什么样的人",
        "type": "next"
    });
db.test.update({id:0},{$set:{image:'https://bestbwzs.com/image/000-castle.jpg'}});
db.test.update({id:1},{$set:{image:'https://bestbwzs.com/image/001-san_francisco.jpg'}});
db.test.update({id:2},{$set:{image:'https://bestbwzs.com/image/002-cornfield.jpg'}});
db.test.update({id:3},{$set:{image:'https://bestbwzs.com/image/003-island.jpg'}});
db.test.update({id:4},{$set:{image:'https://bestbwzs.com/image/004-waterdrop.jpg'}});
db.test.update({id:5},{$set:{image:'https://bestbwzs.com/image/005-barnimages.jpg'}});
db.test.update({id:6},{$set:{image:'https://bestbwzs.com/image/006-barnimages.jpg'}});
db.test.update({id:7},{$set:{image:'https://bestbwzs.com/image/007-barnimages.jpg'}});
db.test.update({id:8},{$set:{image:'https://bestbwzs.com/image/008-barnimages.jpg'}});
db.test.update({id:9},{$set:{image:'https://bestbwzs.com/image/009-barnimages.jpg'}});
db.test.find({},{_id:0,id:1,image:1})

db.test.update({id:0},{$set:{image:'https://wx.bestbwzs.com/image/000-castle.jpg'}});
db.test.update({id:1},{$set:{image:'https://wx.bestbwzs.com/image/001-san_francisco.jpg'}});
db.test.update({id:2},{$set:{image:'https://wx.bestbwzs.com/image/002-cornfield.jpg'}});
db.test.update({id:3},{$set:{image:'https://wx.bestbwzs.com/image/003-island.jpg'}});
db.test.update({id:4},{$set:{image:'https://wx.bestbwzs.com/image/004-waterdrop.jpg'}});
db.test.update({id:5},{$set:{image:'https://wx.bestbwzs.com/image/005-barnimages.jpg'}});
db.test.update({id:6},{$set:{image:'https://wx.bestbwzs.com/image/006-barnimages.jpg'}});
db.test.update({id:7},{$set:{image:'https://wx.bestbwzs.com/image/007-barnimages.jpg'}});
db.test.update({id:8},{$set:{image:'https://wx.bestbwzs.com/image/008-barnimages.jpg'}});
db.test.update({id:9},{$set:{image:'https://wx.bestbwzs.com/image/009-barnimages.jpg'}});
db.test.find({},{_id:0,id:1,image:1})
